# Step 1: Import Libraries

In [3]:
import pandas as pd
import numpy as np

In [3]:
# A numpy array
arr = np.random.randn(4) # random values from std normal distribution
print(type(arr))
print(arr, "\n")

# A pandas series made from the previous array
s = pd.Series(arr)
print(type(s))
print(s)

<class 'numpy.ndarray'>
[-0.45932037  1.61434765 -1.92887615  0.0146644 ]

<class 'pandas.core.series.Series'>
0   -0.459320
1    1.614348
2   -1.928876
3    0.014664
dtype: float64

## Creating a pandas series

s = pd.Series(data, index=index)

## Example: Creating a pandas.Series from a NumPy array

In [4]:
# A series from a numpy array 
pd.Series(np.arange(3), index=[2023, 2024, 2025])

2023    0
2024    1
2025    2
dtype: int64

## Example: Creating a pandas.Series from a list

In [5]:
# A series from a list of strings with default index
pd.Series(['EDS 220', 'EDS 222', 'EDS 223', 'EDS 242'])

0    EDS 220
1    EDS 222
2    EDS 223
3    EDS 242
dtype: object

## Example: Creating a pandas.Series from a dictionary

In [6]:
# Construct dictionary
d = {'key_0':2, 'key_1':'3', 'key_2':5}

# Initialize series using a dictionary
pd.Series(d)

key_0    2
key_1    3
key_2    5
dtype: object

# Example: Creating a pandas.Series from a single value

In [7]:
pd.Series(3.0, index = ['A', 'B', 'C'])

A    3.0
B    3.0
C    3.0
dtype: float64

# Simple Operations

In [8]:
# Define a series
s = pd.Series([98,73,65],index=['Andrea', 'Beth', 'Carolina'])

# Divide each element in series by 10
print(s /10, '\n')

# Take the exponential of each element in series
print(np.exp(s), '\n')

# Original series is unchanged
print(s)

Andrea      9.8
Beth        7.3
Carolina    6.5
dtype: float64

Andrea      3.637971e+42
Beth        5.052394e+31
Carolina    1.694889e+28
dtype: float64

Andrea      98
Beth        73
Carolina    65
dtype: int64

## Identifying missing numbers

In [9]:
# Series with NAs in it
s = pd.Series([1, 2, np.nan, 4, np.nan])
s

0    1.0
1    2.0
2    NaN
3    4.0
4    NaN
dtype: float64

In [11]:
# The hasnans attribute for a pandas.Series returns True if there are any NA values in it and false otherwise:
# Check if series has NAs
s.hasnans

True

In [13]:
# After detecting there are Na values, we might be intersted in knowing which elements in the series are NAs. We can do this using the isna method:
s.isna()

0    False
1    False
2     True
3    False
4     True
dtype: bool

## Check-In

1. The integer number -999 is often used to represent missing values. Create a pandas.Series named s with four integer values, two of which are -999. 
The index of this series should be the the letters A through D.

2. In the pandas.Series documentation, look for the method mask(). Use this method to update the series s so that the -999 values are replaced by NA values. 
HINT: check the first example in the methodâ€™s documentation.

In [15]:
s = pd.Series([1, 5, -999, -999], ['A', 'B', 'C', 'D'])
s

A      1
B      5
C   -999
D   -999
dtype: int64

In [20]:
s.mask(s < 0)

A    1.0
B    5.0
C    NaN
D    NaN
dtype: float64

# Data Frames

The `pandas.DataFrame` is the most used `pandas` object. It represents **tabular data** and we can think of it as a spreadhseet. Each column of a `pandas.DataFrame` is a `pandas.Series`.

In [4]:
d = {'col_name_1': pd.Series(np.arange(3)),
    'col_name_2': pd.Series([3.1, 3.2, 3.3])}

df = pd.DataFrame(d)
df

   col_name_1  col_name_2
0           0         3.1
1           1         3.2
2           2         3.3

In [5]:
df.index = ['a', 'b', 'c']
df

   col_name_1  col_name_2
a           0         3.1
b           1         3.2
c           2         3.3

In [6]:
df.columns

Index(['col_name_1', 'col_name_2'], dtype='object')

In [7]:
df = df.rename(columns = {'col_name_1':'C1', 'col_name_2':'C2'})
df

   C1   C2
a   0  3.1
b   1  3.2
c   2  3.3

In [11]:
df.columns

Index(['C1', 'C2'], dtype='object')

In [13]:
df.columns = ['col_name_1', 'col_name_2']
df

   col_name_1  col_name_2
a           0         3.1
b           1         3.2
c           2         3.3